---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevLinePen
source: html/d5368e5a-6741-555a-5274-cb725c6684f4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevLinePen Property

"Leader Line Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevLinePen { get; }
```